# St7SetSolverTemperatureDependence

Specifies the type of temperature dependence used in the analysis.

long St7SetSolverTemperatureDependence(long uID, long TempType)

Input Parameters

uID

Strand7 model file ID.

TempType

Temperature dependence type; either tdNone or tdCombined.

Applicability

Applicable to quasi-static, nonlinear static and nonlinear transient dynamic analysis.